app/View/Components/Frontend/Layout/Header.php

select `value`, `key` from `general_settings`
---
    public function render(): View|Closure|string
    {
        $basicInfo = GeneralSetting::pluck('value', 'key')->toArray();