app/View/Components/SelectVehicle.php

select * from `vehicle_types`
---
    public function render(): View|Closure|string
    {
        $vehicleTypes = VehicleType::all();