app/View/Components/UserType.php

select * from `user_types`
---
    public function render(): View|Closure|string
    {
        $userTypes = \App\Models\UserType::all();