app/Http/Controllers/Frontend/RegistrationController.php

    public function store(VehicleRequestStore $vehiclerequeststore, BankDetailsRequestStore $bankdetailsrequeststore,RegistrationRequest $request)
    {     DB::beginTransaction();
        try {
        $userValidator = $request->validated();
        $bankdetailValidator =$bankdetailsrequeststore->validated();
        $vehicleValidstor  = $vehiclerequeststore->validated();
        $userValidator['password'] = bcrypt(Str::random(8));
        $fileFields = ['pan_image', 'aadhar_image_front','aadhar_image_back', 'dl_image', 'profile_image'];
        $uploadedFiles = CommonHelper::handleFileUploads($request, $fileFields);
        $userData = array_merge($userValidator, $uploadedFiles);
        $user = User::create($userData);
        $user_id =['user_id' => $user->id];
        $bankdetails = array_merge($bankdetailValidator,  $user_id);
        $user = BankDetail::create($bankdetails);
---
insert into `users` (`user_type_id`, `full_name`, `mobile`, `business_name`, `business_address`, `home_address`, `pan_number`, `aadhar_number`, `dl_number`, `gst_number`, `aadhar_image_front`, `aadhar_image_back`, `dl_image`, `profile_image`, `password`, `updated_at`, `created_at`) values ('1', 'Radhika singh', '9989904442', 'TATA Moters', 'fffff', 'fffff', '12423432', '3454654765', '7657578', '4324232423', 'logo-light_1723357010.png', 'logo_1723357010.png', 'logo_1723357010.png', 'logo_1723357010.png', '$2y$12$TjW7vFXYeCIKgd6TTHq5e.TiPlmirggrg59Lrbbib0HfiDH5enXz2', '2024-08-11 06:16:50', '2024-08-11 06:16:50')
insert into `bank_details` (`account_holder_name`, `account_number`, `ifsc_code`, `bank_name`, `branch_name`, `user_id`, `updated_at`, `created_at`) values ('Raju', '8758436', 'HDFC000HH11', 'HDFC', 'retreter', 7, '2024-08-11 06:16:50', '2024-08-11 06:16:50')