app/Http/Controllers/Frontend/TripController.php

    public function findRide(Request $request){
        $trips = Ride::query();
        $trips = $this->tripFilterService->filter($trips, $request);
        $trips = $trips->paginate(10);
---
select count(*) as aggregate from `trips`